06_soil/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1; 

vertices
(
    ( -0.5 -0.5 -1.5)   // botom
    (  0.5 -0.5 -1.5)
    (  0.5  0.5 -1.5)
    ( -0.5  0.5 -1.5)

    ( -0.5 -0.5  1.5)   // top
    (  0.5 -0.5  1.5)
    (  0.5  0.5  1.5)
    ( -0.5  0.5  1.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 60) simpleGrading (1 1 1)
);

boundary
(
    atmosphere //top and bottom
    {
        type            patch;
        faces           ((4 5 6 7) (0 3 2 1));
    }
    leftWall 
    {
        type            cyclic;
        neighbourPatch  rightWall;
        faces           ((0 4 7 3));
    }
    rightWall 
    {
        type            cyclic;
        neighbourPatch  leftWall;
        faces           ((2 6 5 1));
    }
    frontWall
    {
        type            cyclic;
        neighbourPatch  backWall;
        faces           ((1 5 4 0));
    }
    backWall
    {
        type            cyclic;
        neighbourPatch  frontWall;
        faces           ((3 7 6 2));
    }
);

// ************************************************************************* //
